; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	thermograph3 - mode
	image0 - mode
	image4 - mode
	thermograph2 - mode
	Star6 - direction
	Star5 - direction
	Star1 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation8 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 image4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star10)
	(supports instrument4 image4)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star5)
	(supports instrument5 image4)
	(supports instrument5 thermograph3)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph2)
	(supports instrument7 image4)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 GroundStation7)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 Star10)
	(calibration_target instrument8 GroundStation8)
	(supports instrument9 thermograph2)
	(supports instrument9 image4)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 thermograph2)
	(supports instrument10 image0)
	(calibration_target instrument10 GroundStation8)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(have_image Star11 image0)
	(have_image Planet12 image0)
	(have_image Star13 thermograph2)
	(have_image Planet14 image0)
	(have_image Star15 thermograph3)
))

)

; plan
1. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 5
2. (calibrate satellite3 instrument10 groundstation2)
   added: (calibrated instrument10)
   goals met: 0 of 5
3. (turn_to satellite3 planet14 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet14)
   goals met: 0 of 5
4. (take_image satellite3 planet14 instrument10 image0)
   added: (have_image planet14 image0)
   goals met: 1 of 5
5. (turn_to satellite3 planet12 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet12)
   goals met: 1 of 5
6. (turn_to satellite0 star6 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star6)
   goals met: 1 of 5
7. (take_image satellite3 planet12 instrument10 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 5
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 5
9. (calibrate satellite0 instrument2 star6)
   added: (calibrated instrument2)
   goals met: 2 of 5
10. (turn_to satellite0 star13 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star13)
   goals met: 2 of 5
11. (take_image satellite0 star13 instrument2 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 3 of 5
12. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 3 of 5
13. (take_image satellite0 star15 instrument2 thermograph3)
   added: (have_image star15 thermograph3)
   goals met: 4 of 5
14. (turn_to satellite3 star11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 star11)
   goals met: 4 of 5
15. (take_image satellite3 star11 instrument10 image0)
   added: (have_image star11 image0)
   goals met: 5 of 5
